{
	"disqus": {
		"path": "/notebook/sending-birthday-well-wishes-to-molly/",
		"commentCount": 2,
		"comments": [
			{
				"postId": "1817930379",
				"parentPostId": null,
				"date": "2015-01-26T17:37:20Z",
				"author": "MollyEHolzschlag",
				"avatar": "https://www.gravatar.com/avatar/d41d8cd98f00b204e9800998ecf8427e?d=mm&s=60",
				"message": "<p>I've been quiet because I'm overwhelmed by all of the outpouring of love and kindness from this amazing community of ours. I have to step back a bit and stay offline most of the time to keep myself calm (lol) but I have to pipe up on this post. There's one thing most humans strive for in life and suffer greatly because we rarely get, and that's being understood for WHO WE ARE AS WE ARE. It's difficult to articulate yet I'm sure everyone who has experienced it can relate. Robert Heinlein used the term \"grok\" in what was for me a life-altering book, \"Stranger in a Strange Land\" - the title itself speaks to this very experience. I think it's especially true within Geek Culture to have a sense of being outside of society, and the sense of being misunderstood is therefore heightened. The point? Aaron, I love you to the core of my being for so many reasons, but this one is the greatest reason of all: You Grok Me. I don't know how you did it, but in this post you articulated the me that I perceive myself to be - rather than the me that others assume me to be. For that, there are only two words I can find that remotely address what I feel and they are: Thank You.</p>",
				"replies": [
					{
						"postId": "1817963183",
						"parentPostId": "1817930379",
						"date": "2015-01-26T17:55:51Z",
						"author": "Aaron Gustafson",
						"avatar": "https://www.gravatar.com/avatar/d41d8cd98f00b204e9800998ecf8427e?d=mm&s=60",
						"message": "<p>You’re getting me all misty… I’m so glad you are hanging in there though. You’re one tough cookie and I believe you can and will get through this. I can only imagine what you are going through, but I am hopeful that things will improve soon.</p><p>I love you Molly!</p>",
						"replies": []
					}
				]
			}
		]
	}
}
